---
kind: property
id: P:Autodesk.Revit.DB.Material.MaterialCategory
zh: 材质、材料
source: html/75828584-b04c-7f5e-3eb1-353bca44cdec.htm
---
# Autodesk.Revit.DB.Material.MaterialCategory Property

**中文**: 材质、材料

The name of the material category, e.g. 'Wood'

## Syntax (C#)
```csharp
public string MaterialCategory { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null